WELCOME_MESSAGE = f'''— Привет! 🤚
— Я помогу тебе найти треки в Spotify! 🎧

• Введи автора или название трека, и я покажу результаты по запросу! 💿
• Поддерживаю ссылки на песни, альбомы, плейлисты, исполнителей из Spotify! 🎵
• Также могу скачать обложки песен, альбомов, плейлистов, исполнителей по кнопке ниже. 🖼️
• Умею в текст - просто нажми на кнопку ниже, и я отправлю текст песни на выбранный трек! 📃
• Только оригиналы треков! 🖤
'''

NOT_IN_DB = '❌💾 Трека нет в базе, это может занять чуть больше времени, подождите..'

DOWNLOADING = '⬆️ Скачиваю...'

UPLOADING = '⬇️ Загружаю...'

PROCESSING = '🔄 Обрабатываю...'

ALREADY_IN_DB = '💾 Уже есть в базе, отправляю..'

LYRICS_NOT_FOUND = '❌ Текст песни не найден, попробуйте еще раз'

SONG_NOT_FOUND = '❌ Трек не найден, попробуйте еще раз'

ALBUM_HAS_SENT_SUCCESSFULLY = '🎧 Альбом отправлен!'

PLAYLIST_HAS_SENT_SUCCESSFULLY = '🎧 Первые 50 треков плейлиста отправлены!'